# Cycle Test Informatics Practices questions solved

### Create a DataFrame using list of list sales containg yearwise.

In [1]:
import pandas as pd
lol = [[100.5,12000,20000,50000],[150.8,18000,50000,60000],
       [200.9,22000,70000,70000],[30000.0,30000,100000,80000],
       [40000.0,45000,12500,90000]]
sales = pd.DataFrame(lol,index=['Madhu','Kusum','Kinshuk','Anikit','Shruti'],
                    columns = ['2014','2015','2016','2017'])
print(sales)

            2014   2015    2016   2017
Madhu      100.5  12000   20000  50000
Kusum      150.8  18000   50000  60000
Kinshuk    200.9  22000   70000  70000
Anikit   30000.0  30000  100000  80000
Shruti   40000.0  45000   12500  90000

### Display the row labels of Sales

In [2]:
sales.index

Index(['Madhu', 'Kusum', 'Kinshuk', 'Anikit', 'Shruti'], dtype='object')

### Display the data types of each column of sales

In [3]:
sales.dtypes

2014    float64
2015      int64
2016      int64
2017      int64
dtype: object

### Display the last two rows of Sales

In [4]:
sales.tail(2)

           2014   2015    2016   2017
Anikit  30000.0  30000  100000  80000
Shruti  40000.0  45000   12500  90000

### Display the first two columns of sales

In [5]:
print(sales.iloc[:,:2])

            2014   2015
Madhu      100.5  12000
Kusum      150.8  18000
Kinshuk    200.9  22000
Anikit   30000.0  30000
Shruti   40000.0  45000

### Change the Dataframe sales such that it becomes its transpose

In [6]:
print(sales.T)
print(sales.transpose())

        Madhu    Kusum  Kinshuk    Anikit   Shruti
2014    100.5    150.8    200.9   30000.0  40000.0
2015  12000.0  18000.0  22000.0   30000.0  45000.0
2016  20000.0  50000.0  70000.0  100000.0  12500.0
2017  50000.0  60000.0  70000.0   80000.0  90000.0
        Madhu    Kusum  Kinshuk    Anikit   Shruti
2014    100.5    150.8    200.9   30000.0  40000.0
2015  12000.0  18000.0  22000.0   30000.0  45000.0
2016  20000.0  50000.0  70000.0  100000.0  12500.0
2017  50000.0  60000.0  70000.0   80000.0  90000.0

### Display the sales made by all the sales persons in the year 2017

In [7]:
sales.loc[:,'2017']

Madhu      50000
Kusum      60000
Kinshuk    70000
Anikit     80000
Shruti     90000
Name: 2017, dtype: int64

### Display the sales made by Shruti in the year 2016

In [8]:
sales.loc[['Shruti'],['2016']]

         2016
Shruti  12500

### Delete the data for the year 2014 from the Dataframe Sales

In [9]:
#del sales['2014']
sales.drop('2014',axis=1)

          2015    2016   2017
Madhu    12000   20000  50000
Kusum    18000   50000  60000
Kinshuk  22000   70000  70000
Anikit   30000  100000  80000
Shruti   45000   12500  90000

### Delete the data for salesman kinshuk from the DataFrame Sales

In [10]:
sales.drop(['Kinshuk'])

           2014   2015    2016   2017
Madhu     100.5  12000   20000  50000
Kusum     150.8  18000   50000  60000
Anikit  30000.0  30000  100000  80000
Shruti  40000.0  45000   12500  90000

### Update the sale made by Madhu in 2017 to 100000

In [11]:
sales.loc['Madhu','2017']=100000

### Change the name of the salesperson Ankit to Vivaan and Madhu to Shailesh

In [12]:
sales.rename({'Anikit':'Vivaan','Madhu':'Shailesh'},axis = 'index')

             2014   2015    2016    2017
Shailesh    100.5  12000   20000  100000
Kusum       150.8  18000   50000   60000
Kinshuk     200.9  22000   70000   70000
Vivaan    30000.0  30000  100000   80000
Shruti    40000.0  45000   12500   90000

In [13]:
sales.rename(index={'Anikit':'Vivaan','Madhu':'Shailesh'})

             2014   2015    2016    2017
Shailesh    100.5  12000   20000  100000
Kusum       150.8  18000   50000   60000
Kinshuk     200.9  22000   70000   70000
Vivaan    30000.0  30000  100000   80000
Shruti    40000.0  45000   12500   90000

In [15]:
#A Dataframe DF1 is  created
import pandas as pd
data = {'A':[12,17,21],'B':['34','59','34'],'C':['54','87','78']}
df1 = pd.DataFrame(data)
df1

    A   B   C
0  12  34  54
1  17  59  87
2  21  34  78

In [41]:
#df1.drop(['Total','Order'],axis =1) #KeyError: "['Total' 'Order'] not found in axis"
#df1.drop('A','D') #Value Error No axis named D for object type <class 'pandas.core.frame.DataFrame'>
#df1.d[40,50,60]
df1.loc[:,'D']=[30,40,50]
df1 =df1.assign(sal=[50,60,70])
df1.at[:,'sal1']=[100,200,300]
df1

    A   B   C   D  sal  sal1
0  12  34  54  30   50   100
1  17  59  87  40   60   200
2  21  34  78  50   70   300

In [45]:
import pandas as pd
object = pd.Series([1,2,3,4,5,6],index =['a','b','c','d','e','f'])
print(object['c'])
print(object.head(3))
print(object.tail(2))
print(object['b'::2])

3
a    1
b    2
c    3
dtype: int64
e    5
f    6
dtype: int64
b    2
d    4
f    6
dtype: int64